src/test/resources/com/github/sinall/soapor/payload/example.xml

<?xml version="1.0" encoding="UTF-8" standalone="no" ?>
<SOAP-ENV:Envelope
        SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
        xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/1999/XMLSchema">
    <SOAP-ENV:Body>
        <ns1:doubleAnInteger
                xmlns:ns1="urn:MySoapServices">
            <param1 xsi:type="xsd:int">${param1}</param1>
        </ns1:doubleAnInteger>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
